<template>
    <footer class="footer">
        <div class="footer__top">
            <ul class="footer__menu">
                <router-link to="shop" tag="li">
                    <a>Магазин</a>
                </router-link>
                <router-link to="collection" tag="li">
                    <a>Коллекции</a>
                </router-link>
                <router-link to="about" tag="li">
                    <a>О нас</a>
                </router-link>
                <router-link to="service" tag="li">
                    <a>Сервис и помощь</a>
                </router-link>
            </ul>
        </div>
        <div class="footer__center">
            Доставляем по миру. принимаем к оплате карты<br/>
            платежных систем Мир, Виза, Мастеркард
        </div>
        <div class="footer__bottom">
            <div class="footer__copy">© {{getYear}} «Знай своих». Все права защищены.</div>
            <div class="footer__inst">
                <a href="#" target="_blank">
                    <svg width="28" height="28" viewBox="0 0 28 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M14 2.52247C17.7384 2.52247 18.1808 2.53692 19.6574 2.60416C21.0222 2.6664 21.7636 2.89425 22.2571 3.08598C22.9106 3.33995 23.3769 3.64338 23.867 4.13298C24.3572 4.62313 24.6606 5.08939 24.914 5.74293C25.1057 6.23642 25.3336 6.97777 25.3958 8.34265C25.4631 9.81867 25.4775 10.2616 25.4775 14C25.4775 17.7384 25.4631 18.1808 25.3958 19.6573C25.3336 21.0222 25.1057 21.7636 24.914 22.2571C24.6601 22.9106 24.3566 23.3769 23.867 23.867C23.3769 24.3572 22.9106 24.6606 22.2571 24.914C21.7636 25.1057 21.0222 25.3336 19.6574 25.3958C18.1813 25.4631 17.7384 25.4775 14 25.4775C10.2616 25.4775 9.81867 25.4631 8.34265 25.3958C6.97777 25.3336 6.23642 25.1057 5.74293 24.914C5.08939 24.66 4.62313 24.3566 4.13298 23.867C3.64282 23.3769 3.33939 22.9106 3.08598 22.2571C2.89425 21.7636 2.6664 21.0222 2.60416 19.6573C2.53692 18.1813 2.52247 17.7384 2.52247 14C2.52247 10.2616 2.53692 9.81923 2.60416 8.34265C2.6664 6.97777 2.89425 6.23642 3.08598 5.74293C3.33995 5.08939 3.64338 4.62313 4.13298 4.13298C4.62313 3.64282 5.08939 3.33939 5.74293 3.08598C6.23642 2.89425 6.97777 2.6664 8.34265 2.60416C9.81923 2.53692 10.2616 2.52247 14 2.52247ZM14 0C10.1977 0 9.72086 0.0161162 8.22761 0.0844712C6.73769 0.152271 5.72015 0.389012 4.82931 0.735233C3.90846 1.09312 3.12766 1.57161 2.34963 2.35019C1.57161 3.12821 1.09257 3.90902 0.735233 4.82931C0.389012 5.72015 0.152271 6.73769 0.0844713 8.22761C0.0161162 9.72086 0 10.1977 0 14C0 17.8023 0.0161162 18.2791 0.0844713 19.7724C0.152271 21.2623 0.389012 22.2798 0.735233 23.1707C1.09312 24.0915 1.57161 24.8723 2.35019 25.6504C3.12877 26.4289 3.90902 26.9074 4.82987 27.2653C5.72015 27.6115 6.73825 27.8483 8.22817 27.9161C9.72142 27.9844 10.1982 28.0006 14.0006 28.0006C17.8029 28.0006 18.2797 27.9844 19.7729 27.9161C21.2629 27.8483 22.281 27.6115 23.1712 27.2653C24.0921 26.9074 24.8729 26.4289 25.6509 25.6504C26.4295 24.8718 26.908 24.0915 27.2659 23.1707C27.6121 22.2804 27.8488 21.2623 27.9166 19.7724C27.985 18.2791 28.0011 17.8023 28.0011 14C28.0011 10.1977 27.985 9.72086 27.9166 8.22761C27.8488 6.73769 27.6121 5.71959 27.2659 4.82931C26.908 3.90846 26.4295 3.12766 25.6509 2.34963C24.8723 1.57105 24.0921 1.09257 23.1712 0.734678C22.2799 0.389012 21.2623 0.152271 19.7724 0.0844712C18.2791 0.0161162 17.8023 0 14 0Z" fill="#E5E5E5"/>
                        <path d="M14.0014 6.81104C10.0307 6.81104 6.8125 10.0298 6.8125 14C6.8125 17.9701 10.0313 21.1889 14.0014 21.1889C17.9716 21.1889 21.1904 17.9701 21.1904 14C21.1904 10.0298 17.9722 6.81104 14.0014 6.81104ZM14.0014 18.6665C11.424 18.6665 9.33497 16.5769 9.33497 14C9.33497 11.4225 11.4245 9.3335 14.0014 9.3335C16.5784 9.3335 18.6679 11.4231 18.6679 14C18.6679 16.5775 16.5789 18.6665 14.0014 18.6665Z" fill="#E5E5E5"/>
                        <path d="M21.4729 8.20651C22.4008 8.20651 23.1529 7.45436 23.1529 6.52654C23.1529 5.59871 22.4008 4.84656 21.4729 4.84656C20.5451 4.84656 19.793 5.59871 19.793 6.52654C19.793 7.45436 20.5451 8.20651 21.4729 8.20651Z" fill="#E5E5E5"/>
                    </svg>
                    <span>Следите за новинками</span>
                </a>
            </div>
        </div>
    </footer>
</template>

<script>
    export default {
        name: "MainFooter",
        computed: {
            getYear() {
                const date = new Date()
                return date.getFullYear()
            }
        }
    }
</script>

<style scoped lang="scss">
    .footer {
        background: #24325E;
        padding: 58px 50px 75px;
        @media screen and (max-width: 768px) {
            padding: 50px 25px 50px;
        }
        &__top {
            padding-bottom: 68px;
        }
        &__menu {
            display: flex;
            justify-content: space-between;
            align-items: center;
            list-style-type: none;
            padding: 0;
            margin: 0;
            @media screen and (max-width: 768px) {
                flex-direction: column;
                li {
                    padding-bottom: 10px;
                    &:last-child {
                        padding-bottom: 0;
                    }
                }
            }
            a {
                text-transform: uppercase;
                text-decoration: none;
                color: #E5E5E5;
                font-weight: 500;
                font-size: 16px;
                letter-spacing: 0.12em;
            }
        }
        &__center {
            color: #fff;
            font-weight: 500;
            font-size: 16px;
        }
        &__bottom {
            padding-top: 54px;
            display: flex;
            justify-content: space-between;
            align-items: center;
            @media screen and (max-width: 768px) {
                flex-direction: column-reverse;
            }
        }
        &__copy {
            font-weight: 500;
            color: #fff;
            font-size: 16px;
            @media screen and (max-width: 768px) {
                padding-top: 15px;
                text-align: center;
            }
        }
        &__inst {
            width: 60%;
            @media screen and (max-width: 768px) {
                width: 100%;
                text-align: center;
            }
            a {
                color: #fff;
                font-size: 16px;
                text-decoration: none;
                svg {
                    vertical-align: middle;
                }
                span {
                    position: relative;
                    top: 2px;
                    font-weight: 500;
                    margin-left: 17px;
                }
            }
        }
    }
</style>